app/controllers/activities_controller.rb

  def index
    @activities = Activitie.all
---
SELECT "activities".* FROM "activities"

  def create
    @activity = Activitie.new(activity_params)

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("title", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Et cillum obcaecati "], ["description", "Voluptatem odit et "], ["date", "2017-03-05"], ["created_at", "2019-11-20 16:11:03.249880"], ["updated_at", "2019-11-20 16:11:03.249880"]]

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "title" = $1, "description" = $2, "date" = $3, "updated_at" = $4 WHERE "activities"."id" = $5  [["title", "Quasi jgirejioghiro molest"], ["description", "girjgirjgij omnis at"], ["date", "2024-10-31"], ["updated_at", "2019-11-20 20:40:57.568808"], ["id", 5]]

    def set_activity
      @activity = Activitie.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]