app/controllers/admin_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        @activities = Activitie.all